notebook/app/views/contacts/_form.html.erb

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."contact_id" = ? LIMIT 1  [["contact_id", 11]]
---
        <%= address_fields.label :state %><br>
        <%= address_fields.select :state, state_options_for_select(@contact.address.state) %>