notebook/app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.order(:name).page(params[:page]).per(5)
---
SELECT  "contacts".* FROM "contacts"  ORDER BY "contacts"."name" ASC LIMIT 5 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "contacts" LIMIT 5 OFFSET 0) subquery_for_count

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("name", "email", "kind_id", "rmk", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Maria"], ["email", "maria@maria.com.br"], ["kind_id", 1], ["rmk", "OBS..."], ["created_at", "2018-09-22 14:05:22.093776"], ["updated_at", "2018-09-22 14:05:22.093776"]]

  def update
    respond_to do |format|
      if @contact.update(contact_params)
---
UPDATE "contacts" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["name", "asdf"], ["email", "asdf"], ["updated_at", "2018-08-31 15:22:54.762664"], ["id", 5]]

    def set_options_for_select
      @kind_options_for_select = Kind.all
---
SELECT "kinds".* FROM "kinds"