notebook/app/controllers/kinds_controller.rb

SELECT "kinds".* FROM "kinds"
---
  def index
    @meu_nome = "Maycon Ribeiro"
    @kinds = Kind.all

INSERT INTO "kinds" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Amigo"], ["created_at", "2018-08-30 15:57:20.728697"], ["updated_at", "2018-08-30 15:57:20.728697"]]
---
  def create
    @kind = Kind.new(kind_params)

    respond_to do |format|
      if @kind.save

DELETE FROM "kinds" WHERE "kinds"."id" = ?  [["id", 4]]
---
  def destroy
    @kind.destroy

SELECT  "kinds".* FROM "kinds" WHERE "kinds"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_kind
      @kind = Kind.find(params[:id])